[
    {
        "id": "1519519857611579394",
        "lang": "en",
        "text": "@Nadine_Writes Debt slaves? Hahaha really"
    },
    {
        "id": "1519519850657464320",
        "lang": "en",
        "text": "Same and I don’t even have any student debt https://t.co/DrGNxcDHD9"
    },
    {
        "id": "1519519846261833732",
        "lang": "en",
        "text": "I may be asked to turn in my conservative card for this, but what if we forgive only student loan debt for those that meet ALL of the following: 1. Citizen of The U.S. 2. School Teacher 3. Undergrad only 4. State School  only 5. Must have been employed as a teacher for 5 years."
    },
    {
        "id": "1519519843266957312",
        "lang": "en",
        "text": "@briantylercohen No.  I do not want to pay for colleges and universities who exploited students by steering them to useless degrees, and put them into debt.  Until we reform that system that allows them to add administrative salaries at many times the rate of actual teaching, nothing will change."
    },
    {
        "id": "1519519842356932610",
        "lang": "en",
        "text": "@marwilliamson What about people who went to community college or not their first choice school so they did not accumulate debt?"
    },
    {
        "id": "1519519837504090112",
        "lang": "en",
        "text": "Thanks @POTUS for eliminating student debt. I can know go back to college and get loans that I don’t have to pay back. I’ve always wanted to be a permanent college student. I’ll never have to work again. Wooohoooo! #studentloans"
    },
    {
        "id": "1519519836778287105",
        "lang": "en",
        "text": "Lol they say this as if high income earners don’t ever leverage debt! https://t.co/gtiqniuFV8"
    },
    {
        "id": "1519519836753342464",
        "lang": "en",
        "text": "“You paid for your kids college? Well my parents didn’t pay for mine. That’s why I have student loan debt. Now, get away from my new car. That shit’s expensive.”"
    },
    {
        "id": "1519519836635807744",
        "lang": "en",
        "text": "do you want biden to forgive student debt, or do you really just want permission to finally forgive… yourself"
    },
    {
        "id": "1519519834966568960",
        "lang": "en",
        "text": "@KatTimpf @PlanetTyrus @Gutfeldfox @jimmyfailla Ppl do not want to pay other ppls student loan debt I get that but taxpayers shouldn’t had to fund a 20 yr war in Afghanistan or send 13 billion to Ukraine. I’m all for sending food water meds clothing but not 13 billion!!"
    },
    {
        "id": "1519519829157425152",
        "lang": "en",
        "text": "@PattyMurray No, the Biden Administration needs to remind student loan debt holders that they AGREED to repay the money loaned to them for their useless education.\nThis is another brazen attempt at buying votes.  Democrats are horrible and dishonest."
    },
    {
        "id": "1519519828423237632",
        "lang": "en",
        "text": "Forgiving student debt, creating a free public college option funded by taxpayer dollars the same as we do K-12 education, is exactly what we need to do to make America better. Then we need a public option for healthcare. Then we need more public options for housing. Get it?"
    },
    {
        "id": "1519519825428582401",
        "lang": "en",
        "text": "@Warhorse74 @MrMokelly @KassyDillon There are so many examples of people paying an amount toward their loan equal to the original debt and STILL owing the original debt. Something is wrong when houses and cars can be paid off but degrees aren’t still owed after 10 plus years"
    },
    {
        "id": "1519519801944817665",
        "lang": "en",
        "text": "@MittRomney Aren’t you like a millionaire a hundred times over?  You have no idea what it’s like with student loan debt.  How about you go to one of your mansions and keep your rich guy attitude to yourself."
    },
    {
        "id": "1519519800539508738",
        "lang": "en",
        "text": "Every word one uses is the code to where one dwells, repetitive use of certain words open the portals to liberation or confinement . Equally the words that one capitalises will indeed capitalise them as a debt, balance or acumen of worth."
    },
    {
        "id": "1519519800006823936",
        "lang": "en",
        "text": "@TRUtes3 @utahstu If student debt can be forgiven without coming out of the federal budget (meaning Univeristies and Colleges take the hit) then sure, forgive away."
    },
    {
        "id": "1519519799759577089",
        "lang": "en",
        "text": "@mehser12 @TheRealHoarse @KassyDillon The debt doesn't go away though."
    },
    {
        "id": "1519519784756559872",
        "lang": "en",
        "text": "@vishalmhn @chartbent As rightly pointed out by U, there is no CG issues in #ttml so long run not a big worry since ethical promoters are bringing down debt. In contrast for #brightcom AKA #boguscom promoters R notorious CG issues. Shift to growth PLI stories."
    },
    {
        "id": "1519519783057866758",
        "lang": "en",
        "text": "@NikkiFried @GovRonDeSantis makes blue state governors look hopelessly  incompetent. \n\nThere is a reason people are leaving NY, NJ and CA.\nFlorida's economy is booming while blue states are sinking in debt, bankruptcies and crime."
    },
    {
        "id": "1519519782315298816",
        "lang": "en",
        "text": "@JDVance1 Punish the poor who are hundreds of thousands in debt in an attempt to better their lives! Serves them right!"
    },
    {
        "id": "1519519779652046848",
        "lang": "en",
        "text": "@laurenboebert @elonmusk I’m not sure where you got that number from, but, yeah… paying $44 billion for something that already exists and is structured by debt isn’t anything more than money chasing money. It helps no one… except maybe allows traitors like Trump of Flynn back online."
    },
    {
        "id": "1519519769216565250",
        "lang": "en",
        "text": "@BonginoReport Cancel my debt, cancel everyone’s debt,  what the heck."
    },
    {
        "id": "1519519760714805253",
        "lang": "en",
        "text": "@AlexGelhar Bro how the fuck is forgiving college debt a massive windfall to the rich. I swear to god these people live in a fucking fantasy land."
    },
    {
        "id": "1519519758693056517",
        "lang": "en",
        "text": "@JeremyDBoreing @Oldgloryfighter If any debt should be forgiven, in the USA, it should be medical debt."
    },
    {
        "id": "1519519758198226945",
        "lang": "en",
        "text": "@rapsbry Well, I believe she is also against cancelling student debt, too."
    },
    {
        "id": "1519519754641412096",
        "lang": "en",
        "text": "@Historycourses @ayilbasvach any 30/40-something yr old in a position to be interviewing a new associate, best believe they’ll be super critical and cynical knowing that you’re waltzing in debt free while they salved away and paid 2k/mo on their student loans"
    },
    {
        "id": "1519519752971948032",
        "lang": "en",
        "text": "@iamdogthief @ravagedincorn @not_a_heather Huh? How is the system rigged against you? the people with college debt took it on willingly and consensually… \n\nPlenty of folks like myself have discovered upward mobility without $50k in debt."
    },
    {
        "id": "1519519752141475840",
        "lang": "en",
        "text": "@Dha7131 @netw3rk Dataset is flawed here. If households in the bottom 40% income bracket are less likely to go to college then they would OBVIOUSLY have significantly less student loan debt. You can normalize the data but extrapolating lower income COLLEGE students. Think you’d find it MUCH closer"
    },
    {
        "id": "1519519750082113537",
        "lang": "en",
        "text": "2. This will solve the boomer gripes. No seriously. Sick of millennials living with their parents? Not buying houses? Not having kids? Not starting businesses? Cancel student debt and watch the economy roar."
    },
    {
        "id": "1519519745908768768",
        "lang": "en",
        "text": "@tify330 What is \"real student debt relief\"? This is just becoming a vote suppressing Putin op at this point."
    },
    {
        "id": "1519519735024607234",
        "lang": "en",
        "text": "@rdwtbl2u3 @pinchmyloaf @ewesonasty @sgtrudy0311 @AppliedWizardin @LPofMN @elonmusk This. The difference between outstanding banknotes and our gold reserves reflects the fundamental problem. We can’t afford to pay the debt we’ve issued. Backing notes with GDP/tax potential is mortgaging our grandchildren’s labor. Hard assets are the only legitimate currency."
    },
    {
        "id": "1519519728598851584",
        "lang": "en",
        "text": "@daukherville Hahahah so you’re down to take on their debt via taxes? No you paid yours off as I did, why would you want this"
    },
    {
        "id": "1519519722756362240",
        "lang": "en",
        "text": "@intheivorytower @charliebilello People with cancer didn’t choose it. People with debt signed up for it. Big flaw in your argument"
    },
    {
        "id": "1519519720000655362",
        "lang": "en",
        "text": "@elonmusk Hey Elon, could you send me half a million? I want to pay off debt, and invest and start my own game development company."
    },
    {
        "id": "1519519712278835200",
        "lang": "en",
        "text": "~we are not in the mood to hear your moral judgments about people who incur debt in a society that essentially requires you to have it~"
    },
    {
        "id": "1519519709686685698",
        "lang": "en",
        "text": "@mcbyrne @Will_Bunch @RashidaTlaib @WhiteHouse A good first step: Have the feds buy all existing student and reissue it back to student debt interest-free.\n\nThen look at schools and programs whose graduates tend to not acquire the earning power to payback loans."
    },
    {
        "id": "1519519701767909376",
        "lang": "en",
        "text": "@KassyDillon And yet there were people who paid nothing for their higher education when the California state university system was free. So shouldn't they be furious that you had to go into debt for years to just get a higher education?"
    },
    {
        "id": "1519519690254700550",
        "lang": "en",
        "text": "@KassyDillon It’s crazy that our generation expects $60K in loan debts to vanish into thin air. What makes us so entitled? The system is broken, but erasing debt is not the fix."
    },
    {
        "id": "1519519689600339968",
        "lang": "en",
        "text": "@Hail_the_Fist @engigoes @ChuckGoat1 @WisconsinJim2 @_Rewhan @MittRomney No where in the constitution does it grant the right for a free college education. Nor does it grant the right to be debt free."
    },
    {
        "id": "1519519686739771392",
        "lang": "en",
        "text": "@PattyMurray And what do the people who don’t have college debt get?"
    },
    {
        "id": "1519519681052397568",
        "lang": "en",
        "text": "@RandyBurtonJR1 @CPatt19937257 @KimDotcom @Twitter @elonmusk CPatt decides. She’s perfect. You must ask her what is a proper thought before you express it. CPatt is a real girl boss!!  So smart as she’s 50k in debt.  Whaddadope"
    },
    {
        "id": "1519519679168991233",
        "lang": "en",
        "text": "Most of the people who are against the government paying off student loan debt had parents who paid off their student loan debt."
    },
    {
        "id": "1519519674756571136",
        "lang": "en",
        "text": "@ChuckCallesto This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519672412033024",
        "lang": "en",
        "text": "@PattyMurray I didn't go to college, why should I pay it? Make the school forgive the loans or PAY YOUR OWN DEBT!"
    },
    {
        "id": "1519519666460413953",
        "lang": "en",
        "text": "@RussMach1972 @DanFmTo @SenSanders They're rather stuck paying, but not enough to keep themselves from sliding back on the loan, sending them further into debt no matter how much they save or how prudent they are with their money."
    },
    {
        "id": "1519519665457750016",
        "lang": "en",
        "text": "@GOPLeader FACT➡️ Debt can be forgiven. It doesn’t have to be transferred.\n\nAsk any parent of 20 somethings."
    },
    {
        "id": "1519519664208060416",
        "lang": "en",
        "text": "@jeffh6730 @SenSanders I'm paying mine off as we're speaking. No sir, I don't want to live the debt life. I want my life to be debt-free."
    },
    {
        "id": "1519519663906037765",
        "lang": "en",
        "text": "@PattyMurray Why the fuck should our tax payer dollars pay for personal debt. Are you going to just forgive my business debt after you let this administration closed my business down over a PLANNEDEMIC hell no your not.. How about you people fix what's wrong in this country and stop pandering"
    },
    {
        "id": "1519519659791462401",
        "lang": "en",
        "text": "@MitchGerads As a shop owner I using this as a window advertisement if student debt gets canceled"
    },
    {
        "id": "1519519645153337349",
        "lang": "en",
        "text": "Looming Threats in the Global Economy? | The Agenda https://t.co/mbzaJNHrZX via @YouTube \"It is our MORAL DUTY to end this war!\" #eND4pROFITwar \"Debt is to Capitalism, what Hell is to Christianity.\""
    },
    {
        "id": "1519519645065220098",
        "lang": "en",
        "text": "@ElieNYC Why the fuck should I have to pay for anyone's education when I couldn't afford one for myself.  You chose to go into debt you deal with it."
    },
    {
        "id": "1519519641017765889",
        "lang": "en",
        "text": "@rescott534 Truth!! But we will see how much they advocate for it when they find out, who will get the debt relief!"
    },
    {
        "id": "1519519639709130754",
        "lang": "en",
        "text": "For this generation to be the last one with student debt, we actually have to stop more student debt from accumulating. And I don't see enough attention to that part. Or do we just wait for a Dem Pres to forgive debt every 20 years?"
    },
    {
        "id": "1519519625737875456",
        "lang": "en",
        "text": "@jmstorck @Kennymack1971 Except Black Women.  Who are holding the lion's share of student debt and literally are responsible for Biden's election.  There's no downside for Biden of middle and lower class student debt cancellation and it to those voters it won't matter what the Republicans say about it."
    },
    {
        "id": "1519519617755934721",
        "lang": "en",
        "text": "Imagine not understanding the concept of Consent Under Duress (being told if you don't go into debt peonage to get a degree you won't get a decent-paying career) https://t.co/cOl9ciHXKC"
    },
    {
        "id": "1519519615046627328",
        "lang": "en",
        "text": "What are we doing? Elon can cancel student debt 😤"
    },
    {
        "id": "1519519613532483586",
        "lang": "en",
        "text": "@Wolfiesmom Learned tonight. Bankruptcy, all debt if forgivable. Except for student loan debt. There are ppl having their SS payments docked to repay it. @SenWarren on @TheBeatWithAri tonight."
    },
    {
        "id": "1519519611284164608",
        "lang": "en",
        "text": "@SenSanders You forgot to mention how much the taxpayers shell out for you &amp; the worthless band of hucksters on Capital Hill.  Whatever they they pay you &amp; your staff is wasted money that should go to pay down debt. The countries debt, not entitled students who decided to renig."
    },
    {
        "id": "1519519610034429952",
        "lang": "en",
        "text": "@Jim_Jordan Student loan debt is stupid lol"
    },
    {
        "id": "1519519605429047296",
        "lang": "en",
        "text": "@HillaryGuess @SenSanders Aperantly we were a sucker for paying ours off.  Now we have debt again because we have to pay someone else's loan."
    },
    {
        "id": "1519519604577501184",
        "lang": "en",
        "text": "@tashakaminsky @KoenigRyan So ducking stupid. Who forced you into debt?"
    },
    {
        "id": "1519519598927699968",
        "lang": "en",
        "text": "@GR13579Z @AaronParnas How is debt made?"
    },
    {
        "id": "1519519597988298753",
        "lang": "en",
        "text": "@marwilliamson Tax dollars going to rich arrogant students who flunk out and who want debt relief to go to the casinos to gamble more."
    },
    {
        "id": "1519519594381160448",
        "lang": "en",
        "text": "@MittRomney This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519593953251328",
        "lang": "en",
        "text": "@JosephSTally1 @flexghost1 The IRS can confiscate anybody's assets if it's found out that the assets were obtained illegaly or to settle your debt.  In many states the police can confiscate your car and property and sell it to benefit the police department.  Talk about conflict of interest."
    },
    {
        "id": "1519519592124751872",
        "lang": "en",
        "text": "@JasonForNC Students who have their student debt forgiven, will still be struggling after their debt is forgiven."
    },
    {
        "id": "1519519590195384320",
        "lang": "en",
        "text": "@bubba_wubba @CurtisAMay4552 @PressSec @GOP Actually, he increased the debt but reduced the deficit."
    },
    {
        "id": "1519519587473178624",
        "lang": "en",
        "text": "@thirsty_mcgirt @DVineMsM @LDonivan @HenryHowards1 @ElieNYC how do you dodge the conclusion so badly lol your kids will die under the throats of government debt have a good one"
    },
    {
        "id": "1519519584365162497",
        "lang": "en",
        "text": "@KyleKulinski Imagine believing that millions of people should have debt simply because you did."
    },
    {
        "id": "1519519581441777665",
        "lang": "en",
        "text": "We owe men like United States Army Major James Alvin Russ a debt that we cannot repay, take a second and read... you'll feel that chill that I feel..  😢🤗 https://t.co/EaS2i1W5BW"
    },
    {
        "id": "1519519580741246976",
        "lang": "en",
        "text": "@NoLieWithBTC @MittRomney Helping them stay afloat is not spending a significant amount of money we don't have so our dollar stays strong. People chose their debt. Plenty of high paying jobs available without a degree - in fact a massive labor shortage in tradework."
    },
    {
        "id": "1519519578119983105",
        "lang": "en",
        "text": "Yeah just go ahead and forgive all our student loan debt @JoeBiden 😆😏"
    },
    {
        "id": "1519519577536745472",
        "lang": "en",
        "text": "@StephenMoore @Hilohaw Biden should just cancel everyone debt! What could go wrong? #canceleveryonesdebt"
    },
    {
        "id": "1519519574324092930",
        "lang": "en",
        "text": "@briantylercohen I need to suffer even though I incurred no debt????? How ridiculous is that??"
    },
    {
        "id": "1519519571664908288",
        "lang": "en",
        "text": "@SantiagoAuFund MMT is the path that we are taking in steps, with a big step taken in the pandemic.\n\nSince debt is saturated at any level sorry from govt, it's natural that govt takes this time in a system where any participants are unwilling to take any losses.\n\nSo more debt gets piled on. 1/2"
    },
    {
        "id": "1519519571568476161",
        "lang": "en",
        "text": "@Icarus39832944 @brianschatz I wish it’s how it worked. If so, a lot of that debt wouldn’t even exist."
    },
    {
        "id": "1519519570721185794",
        "lang": "en",
        "text": "I've got a liberal friend that received about 10 grand in COVID stimulus money. None in his family was laid off work. He complains that his student debt is not forgiven yet. He used none of the free money to pay down his loan! He insists the free money was not meant for that!"
    },
    {
        "id": "1519519568787476480",
        "lang": "en",
        "text": "No fuck that cause it will end up with me paying off their debt in taxes, so I paid my school loans off and have to pay more in taxes for lazy gender studies students no thanks I’ll pass https://t.co/7afL0fy9e5"
    },
    {
        "id": "1519519562990989313",
        "lang": "en",
        "text": "@SenSanders Your country cannot afford bail outs, tax cuts, or moon missions.\n\nNow you want to cancel ALL student loan debt? Do the world economy a favour and retire Bernie."
    },
    {
        "id": "1519519561992708097",
        "lang": "en",
        "text": "@TomCottonAR The squad is pushing to have college debt wiped out because they owe money and they don't want to pay it back. They make close to $200,000 a year they can pay their own debts instead of buying Teslas and designer shoes and clothes."
    },
    {
        "id": "1519519556083007488",
        "lang": "en",
        "text": "@KeithOlbermann You sign up for the debt, you pay the debt. Taxpayers shouldn't have to bail you out."
    },
    {
        "id": "1519519552161271812",
        "lang": "en",
        "text": "@Crof Cancel it and compensate young people who didn’t get the chance to attend, let alone incur debt. That would be a more redistributive approach."
    },
    {
        "id": "1519519548076089344",
        "lang": "en",
        "text": "Rep. Rashida Tlaib Backs Biden Canceling Student Debt, Slams Billionaires #rashida #tlaib #backs #biden #canceling #student #debt #slams #billionaires  https://t.co/WEGXvagx1U"
    },
    {
        "id": "1519519546893344769",
        "lang": "en",
        "text": "@PattyMurray You want to help people start forgiving income tax. That helps the people who didn’t go to college and incur debt….."
    },
    {
        "id": "1519519541713326080",
        "lang": "en",
        "text": "@akeblay @Stonekettle Forgiving student loans will drive inflation even further. It's no different than printing money.\n\nThere's about $1.5 trillion in federal student loan debt right now. If you thought inflation was bad last year, it'll be a lot worse after forgiving those loans."
    },
    {
        "id": "1519519538831757312",
        "lang": "en",
        "text": "So let’s say you have 100k in debt from your fancy private school and make 50k as a social worker. ~$2.5k/mo net income, 50% to rent, 25% to food and entertainment and you still say you can’t scrap together 6k per year for interest. HTF are you gonna afford taxes on 150k? https://t.co/ZAUWkmP4fN"
    },
    {
        "id": "1519519536600526849",
        "lang": "en",
        "text": "@matt_okeefe Eh, not getting into anything else, but I know the two-year pause on interest has actually allowed a lot of people to quietly pay them off and get out from under that debt. And she's relatively young, so the interest hasn't been building for too long."
    },
    {
        "id": "1519519518472773632",
        "lang": "en",
        "text": "@AlixG_2 @Lefty_Mind Student debt really ain't that bad tbf. \nI have been using that stuff for a few years now and just by getting a part time job i pretty much managed to stay on top of my game. \n\nUsed the \"extra\" loans to get a used car which i used to drive to my job.\n\nIt's called \"get good\""
    },
    {
        "id": "1519519510495121409",
        "lang": "en",
        "text": "@unidentifiedta1 A rising tide lifts ALL boats.....cancel the student debt.  Being in real estate the amount of debt some of these young adults have is ridiculous...and yes I paid mine as well...I stand for this 100%."
    },
    {
        "id": "1519519509467435008",
        "lang": "en",
        "text": "@garfnic_ Biden is talking about forgiving student loan debt"
    },
    {
        "id": "1519519503436103680",
        "lang": "en",
        "text": "@donellacandra Any smart person wouldn't be giving money away unless they have their affairs in order. Judging by our debt and how often we print new money that's not backed, I'd say we don't have our affairs in order, and definitely don't have the money."
    },
    {
        "id": "1519519499136999427",
        "lang": "en",
        "text": "@elonmusk could paying off my college debt be next on your to-do list https://t.co/I8yHvrijZV"
    },
    {
        "id": "1519519497891332096",
        "lang": "en",
        "text": "@johnpavlovitz I could see their debt being restructured, but outright forgiveness of a promise is wrong. For starters what about so many who paid their loans? How about those that did not go to college that pay taxes? This would be no different than forgiving boat loans or car loans."
    },
    {
        "id": "1519519497459228672",
        "lang": "en",
        "text": "@Debt_For_Pets RT🔃 for mommy\n\npaypig findom femdom paypigs findomme ukpaypig  payslut  payslave payloser  financialdomination femdomme  feetfetish footfetsh assworship booty feet"
    },
    {
        "id": "1519519495349579776",
        "lang": "en",
        "text": "@BonginoReport @dbongino If debt is canceled I would like the $250,000 Back I paid for three kids college educations."
    },
    {
        "id": "1519519493516664833",
        "lang": "en",
        "text": "@PattyMurray Pay your own damn debt! https://t.co/n3pCkMx8E9"
    },
    {
        "id": "1519519488546570240",
        "lang": "en",
        "text": "@TristanSnell Perhaps we can reach a consensus on the wisdom or folly of forgiving student loan debt by only allowing people who want their student debt forgiven to talk on the subject. 🤡"
    },
    {
        "id": "1519519487954980868",
        "lang": "en",
        "text": "@MuellerSheWrote @Leslieoo7 That only applies to medical debt that has been PAID!"
    },
    {
        "id": "1519519484452634626",
        "lang": "en",
        "text": "The way it went from most to \"SOME\" student debt. He can keep playin games if he wants to. fuq around and find out when midterms come! https://t.co/qT50CaLwBM"
    },
    {
        "id": "1519519447886749696",
        "lang": "en",
        "text": "@xtinasandsbrown @KayeSteinsapir I paid for college myself. I also studied abroad 2x. And got my masters degree. No loans. No help from my parents. I commuted to a state college. Graduated in 3.5 yrs There’s ways to get an education without debt. I waitressed &amp; graduated with a 3.93 GPA.🤷🏻‍♀️"
    },
    {
        "id": "1519519447068950528",
        "lang": "en",
        "text": "@ZaidJilani Monthly payment is kind of a stupid subject tho caz some have income driven payment. So, if they are not earning enuf, they are not paying as much. But they are on track to be in debt for the rest of their lives."
    },
    {
        "id": "1519519441624522753",
        "lang": "en",
        "text": "@JDCocchiarella This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519440345321472",
        "lang": "en",
        "text": "This fucking matters. \n\nWe get money back into the economy by eliminating this now-proven arbitrary debt and putting dollars in American’s hands to spend. https://t.co/Kpd1CiVhZB"
    },
    {
        "id": "1519519439481229312",
        "lang": "en",
        "text": "The only legit reasoning to cancel student debt. https://t.co/Quf81vlrA4"
    },
    {
        "id": "1519519436989939713",
        "lang": "en",
        "text": "@TheRickyDavila No, I don’t give a flying fuck about Mitt Romney’s anger!! I care about the President canceling student loan debt, it’ll be so helpful to so many Americans struggling to pay back their loans. Thanks to President Biden those Americans can now focus on paying their other bills!🤞🤞"
    },
    {
        "id": "1519519430832652289",
        "lang": "en",
        "text": "@PattyMurray Who signed that student debt contract?\n\nWhats next, car loans, home loans, business loans?"
    },
    {
        "id": "1519519429771415552",
        "lang": "en",
        "text": "@KATUNews Horse crap! Are they going to forgive business loans and trade school debt too?"
    },
    {
        "id": "1519519415821389824",
        "lang": "en",
        "text": "@KinseyAndrew Mine loans are paid. But had I gotten forgiveness, I’d be mortgage free by this point and having zero debt—that’s life changing. Getting out from under student loans and the crushing interest would truly be life changing for so many people."
    },
    {
        "id": "1519519414189793280",
        "lang": "en",
        "text": "@ccowboy723 I did my time in the Navy to get my GI Bill. So, no. I will not allow the government to steal my money to pay for some whiney kid's stupidity. They took that loan on themselves. They should have asked questions before signing for the loan. They should work to eliminate that debt."
    },
    {
        "id": "1519519413703163911",
        "lang": "en",
        "text": "@KeithOlbermann @KassyDillon Who is the “us”, KO? You have student loans? Are you the “our”? Hers is a perfectly legitimate complaint and, while she may suffer unintended consequences from a federal relief program, she did -responsibly- pay off all her student loan debt and all you can do is attack her."
    },
    {
        "id": "1519519411673075712",
        "lang": "en",
        "text": "@Mon4Kooyong @JoshFrydenberg First treasurer to take Australia to a trillion dollar debt and lose the shiny blue ribbon Kooyong for the first time since federation. What a legacy Josh, no wonder you can’t face your people"
    },
    {
        "id": "1519519406925094913",
        "lang": "en",
        "text": "@AaronParnas This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519402458238978",
        "lang": "en",
        "text": "My flat tummy &amp; busty breasts put you in fucking debt ✨"
    },
    {
        "id": "1519519400625426432",
        "lang": "en",
        "text": "@jeffnowlin8176 @Tsherm66 @OrangeJuliusEsq @KassyDillon Education is a human right. And I implore you to read even ONE article about the massive difference b/w student loan debt and other consumer debt. It is predatory and designed to be so\n\nhttps://t.co/mh2VECOAlb"
    },
    {
        "id": "1519519388520517632",
        "lang": "en",
        "text": "@PattyMurray Tell @JoeBiden to donate his quarterly pay checks to relieve that debt."
    },
    {
        "id": "1519519386243059712",
        "lang": "en",
        "text": "@natstev I doubt it too, but either way it’d be a double standard. I worked and sacrificed while in college so I wouldn’t have any to pay off. I think debt forgiveness is the wrong solution to rising college costs, but I’m not surprised given the idea’s source."
    },
    {
        "id": "1519519384796020741",
        "lang": "en",
        "text": "@DonaldJTrumpJr But the college grads are the ones that make the money. Like they've been telling us for years. OK. how about we forgive the loan debt by consolidating the debt and evenly distribute it to all of the college grads. Because I'm not paying for your bad choices."
    },
    {
        "id": "1519519378668236802",
        "lang": "en",
        "text": "@ambernoelle If/when they forgive loans, they should stop making loans that day and create need-based grants instead of saddling kids w/ debt.\nTBH, I know upper middle class students who took out low-interest loans and then used the cash to invest. Amateur leverage/interest rate arbitrage."
    },
    {
        "id": "1519519375447011328",
        "lang": "en",
        "text": "@PlanetTyrus some funny stories come from being a debt collector. Had a guy actually fart in the phone, it was all I could do to not laugh. Car loan collections."
    },
    {
        "id": "1519519372066410497",
        "lang": "en",
        "text": "@Loogiesdad My argument is that your point isn't relevant. It's myopic and misses the critical reality that the debt is suffocating America's middle class...and with a faltering middle class the American experiment becomes tenuous."
    },
    {
        "id": "1519519369570754560",
        "lang": "en",
        "text": "@SenSanders Im not paying off someone else debt."
    },
    {
        "id": "1519519355775569921",
        "lang": "en",
        "text": "@NoLieWithBTC This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519355536822274",
        "lang": "en",
        "text": "@Peter_Fitz he may have to answer some real questions... thats not in the @ScottMorrisonMP LNP marketing campaign booklet...\n\n#LibsAlwaysTaxMore and we get nothing for it except debt and waste"
    },
    {
        "id": "1519519355477762055",
        "lang": "en",
        "text": "@GPat31415 @RecreationalAn1 @pszalai123 @ninaturner @MittRomney Second round of pandemic relief, $1400 mostly went to debt collectors, if you're poor https://t.co/GFEL6inkdP"
    },
    {
        "id": "1519519346032263169",
        "lang": "en",
        "text": "https://t.co/owiMHIdZr1 The Govt Should Slash Taxes, Slash Immigration, Slash Debt, Stop Being Woke and Start Fighting Woke"
    },
    {
        "id": "1519519344866340864",
        "lang": "en",
        "text": "@MittRomney If people are not on debt after pursuing higher education, they are free to make more decisions untethered from financial stress and are therefore freer to think openly about the world around them instead of \"grinding\" 24/7\n\nThank you for letting us know what you fear, Mitt :)"
    },
    {
        "id": "1519519343570145280",
        "lang": "en",
        "text": "@KassyDillon I worked my ass off in the Army and fought in two wars so that I wouldn’t have any college debt. \n\nI would be delighted for student loans to be forgiven."
    },
    {
        "id": "1519519343565959169",
        "lang": "en",
        "text": "@judyjourney @johncusack I have no student debt and I still think it’s bullshit. #CancelStudentDebt"
    },
    {
        "id": "1519519343083724800",
        "lang": "en",
        "text": "@Gutfeldfox Most students who start college are 18. In America, you can VOTE when you are 18. If you're capable of making a decision that affects everyone in the country, you are capable of deciding your major and how much debt you can take on when you start working in that field."
    },
    {
        "id": "1519519330983063552",
        "lang": "en",
        "text": "@elonmusk Hmm. Let’s aggressively NOT help you pay off your Twitter debt by not rolling over &amp; letting  you monetize the real product- the twitterers. If we click I don’t want to see this ad &amp; give no reason for every single ad might that lower the rate you can charge advertisers? How fun!"
    },
    {
        "id": "1519519329271705603",
        "lang": "en",
        "text": "Also remarkable that people seem so willing to accept debt relief and government bailouts for corporations, but for individual borrowers, it's all \"tough luck.\""
    },
    {
        "id": "1519519328734904320",
        "lang": "en",
        "text": "@mrsalzwedel One thing left out of discussions is the percentage of student loan debt held by those without a college degree.\nIt is a lot higher than people think."
    },
    {
        "id": "1519519328391028739",
        "lang": "en",
        "text": "@rapsbry @and_my_opinion @peormntt @spacebatsonmars @athens_lawyer @briantylercohen And the timeline doesn't really matter to my point, which is about TODAY'S college grads, who are FAR better off in general than non college grads. \n\nCancelling student debt is literally subsidizing the rich."
    },
    {
        "id": "1519519313253658624",
        "lang": "en",
        "text": "@artman182 @NoLieWithBTC I've been called a liberal, and worse, and canceling student debt IS cool in my book. I paid off my college loans, &amp; most of my kids' loans, and I love the idea of tens of millions of Americans being seriously less financially stressed and better able to get on with their lives."
    },
    {
        "id": "1519519311206907904",
        "lang": "en",
        "text": "@Jim_Jordan This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519311135576065",
        "lang": "en",
        "text": "Canceling student debt would make be buy a Biden Flag."
    },
    {
        "id": "1519519310271688705",
        "lang": "en",
        "text": "@Debt_For_Pets Oh yes mommy🔥😵‍💫\n\npaypig findom femdom paypigs findomme ukpaypig  payslut  payslave payloser  financialdomination femdomme  feetfetish footfetsh assworship booty feet"
    },
    {
        "id": "1519519297252597762",
        "lang": "en",
        "text": "@ToddAultIII @BitnileHoldings If you don’t mind me asking, how much was the payment of senior secured debt?"
    },
    {
        "id": "1519519294698139650",
        "lang": "en",
        "text": "I don’t want Biden to cancel student debt, I want him to arrange me a dinner with Jay Z so I can really start grinding 💯💰💯"
    },
    {
        "id": "1519519293343469568",
        "lang": "en",
        "text": "when asked about his plans for student debt, biden was quoted as saying, “youre gonna like the way you look, i guarantee it”"
    },
    {
        "id": "1519519261613428736",
        "lang": "en",
        "text": "@Stonekettle Exactly!! Just because you did, doesn’t mean everyone can, or that everyone can and still live. I hope my kids grow up able to go to school without student debt."
    },
    {
        "id": "1519519257285038082",
        "lang": "en",
        "text": "@iamgabesanchez Standard debt of $Tsla to refinance into debt purchase of Twitter did not work out so well. \n\nExtreme Money: Masters of the Universe &amp; the Cult of Risk (book) https://t.co/E2oryLS1OV"
    },
    {
        "id": "1519519255162728449",
        "lang": "en",
        "text": "@MittRomney Some background and context \n\nhttps://t.co/L0LcJCPPDx"
    },
    {
        "id": "1519519249794048000",
        "lang": "en",
        "text": "@NikkiHaley Nobody should have to pay for other peoples debts period. If said person creates debt that person should be responsible to pay that debt back."
    },
    {
        "id": "1519519247495581697",
        "lang": "en",
        "text": "Perspective: 78% of college grads have less than 30k in debt. The average cost of a new car is also 30k. One is a national crisis needing a government intervention. The other is fine. What does this mean? A college degree is worth less to us than a new car."
    },
    {
        "id": "1519519243687112704",
        "lang": "en",
        "text": "@PattyMurray No! Stop this madness. Our money will soon be worthless if we don’t get serious about overspending and increasing debt!"
    },
    {
        "id": "1519519240922882051",
        "lang": "en",
        "text": "@PattyMurray NO! Our family struggled and made numerous sacrifices so our children wouldn't have more student debt than we/they could afford to pay off. Those who owe chose to take loans at expensive schools. And interest rates went way up when YOUR PARTY bundled it into Obamacare."
    },
    {
        "id": "1519519239849271298",
        "lang": "en",
        "text": "Has Raila addressed how he is going to deal with the high debt rate in this country. What will he do?\n\n#KingsOfCrisis https://t.co/SAF8pq4XiO"
    },
    {
        "id": "1519519238532255744",
        "lang": "en",
        "text": "@DallasDirtCandy Wiping out the debt only makes sense if we also put a cap on tuition costs to prevent loans from being needed going forward. Wiping the slate clean makes sense because it’s holding us all back from the economic growth. We bail out farmers, banks and automakers, why not students?"
    },
    {
        "id": "1519519236783149057",
        "lang": "en",
        "text": "@MittRomney What a dishonest debt comparison. You have no argument when THIS is your argument."
    },
    {
        "id": "1519519230550441984",
        "lang": "en",
        "text": "@PattyMurray What’s wrong with you? You sign for debt, you pay debt. That’s it. Huh?"
    },
    {
        "id": "1519519220295356416",
        "lang": "en",
        "text": "@KellDA @TomCottonAR This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519217124622336",
        "lang": "en",
        "text": "@ElieNYC No one forced anyone to take out a loan, that’s totally selfish to believe others are responsible for your debt.\n # PAY YOUR OWN BILLS!"
    },
    {
        "id": "1519519217040695296",
        "lang": "en",
        "text": "@cioccolanti He also got the credit agencies to wipe off medical debt also..."
    },
    {
        "id": "1519519215555952641",
        "lang": "en",
        "text": "@GenevieveCocoa @estern839 @POTUS 3. It's people like YOU, who think college is needed to \"live a normal life,\" that are the cause of most of this problem. First you convince kids that they *must* go to college, and now you complain when they have too much college debt. Sheesh. #Logic"
    },
    {
        "id": "1519519213559427073",
        "lang": "en",
        "text": "@SensualCMT @PoliticsInsider No. But there are those mainly in 1 political party who incurred the debt by majoring in things that would not help them get good paying jobs, such as gender studies or sjw bull."
    },
    {
        "id": "1519519210556297216",
        "lang": "en",
        "text": "@OctopusCaveman They need to factor that into the plan.  Give all those with non-student debt honorary degrees in something."
    },
    {
        "id": "1519519198967435266",
        "lang": "en",
        "text": "I'm in favor of canceling student loan debt for a number of reasons, but primarily because education should be free and students should never have had to take out loans in the first place"
    },
    {
        "id": "1519519194655727616",
        "lang": "en",
        "text": "@harrisonjaime And other countries do not make college a debt burden. Canada McGill Univ = yearly in state tuition of CAD 2725 USD @ 2000. Univ. of Toronto CAD 6590 USD @ 5000. Univ of VA =yearly in state tuition of USD 18,960. Univ NC yearly in state tuition USD 8990. Getting the picture?"
    },
    {
        "id": "1519519192491429888",
        "lang": "en",
        "text": "@ronmarz Housing is affordable — find a way to increase the prices or taxes or both!\n“Well, damn, I can’t afford housing. I should’ve joined the military or taken a student loan debt on to make sure I got a ‘quality career position’ and afford housing.\n\nExcept it never works that way."
    },
    {
        "id": "1519519183985278976",
        "lang": "en",
        "text": "@Leslieoo7 “Medical debt” should be considered utterly abhorrent on its face. \nAnd it IS in most countries"
    },
    {
        "id": "1519519180160069632",
        "lang": "en",
        "text": "@NikkiHaley A reminder that @NikkiHaley had absolutely no problems with supporting the #TrumpTaxCuts  that will add 2.8 trillion to the National Debt (the debt had risen to an historic $7.8 trillion during Trump's watch)\n\nThat debt will NOT be payed by the super-rich.\n\n#studentloans"
    },
    {
        "id": "1519519172753043456",
        "lang": "en",
        "text": "@delmartian4 How does he have the authority to waive student loan debt?"
    },
    {
        "id": "1519519171511476225",
        "lang": "en",
        "text": "@KassyDillon Just forgiving an unseemly amount of debt is a bad idea. It’s also a bad idea to financially kneecap an entire generation."
    },
    {
        "id": "1519519169862987776",
        "lang": "en",
        "text": "@briantylercohen @CBSNews This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519168151703552",
        "lang": "en",
        "text": "@NoLieWithBTC @MittRomney It also helps the economy.  People who are buried under crippling debt would actually have money they could spend and save."
    },
    {
        "id": "1519519157477199874",
        "lang": "en",
        "text": "@1nancyschindler @Jgo2063 @DWPippy My parents sacrificed to put me through school. I am grateful. My parents want future generations to have an easier path. They fully support canceling the debt."
    },
    {
        "id": "1519519156391059457",
        "lang": "en",
        "text": "@ElieNYC I’m fine with canceling all student loan debt as long as they pass a law outlawing them so there will be no more in the future."
    },
    {
        "id": "1519519154289745923",
        "lang": "en",
        "text": "“I can’t pay my student loans back and I want to start a business. See, I’m an online influencer and I want to grow my brand and I can’t do that with all that debt hanging over me. I have dreams beyond owning my own hair salon like a high school dropout like you.”"
    },
    {
        "id": "1519519150841876480",
        "lang": "en",
        "text": "@GOPLeader I paid off my student loans years ago, but they were reasonable. Now students graduate with hundreds of thousands of debt. How am I loser if other’s loans are forgiven. Also many attorneys are not wealthy"
    },
    {
        "id": "1519519149936025601",
        "lang": "en",
        "text": "@elonmusk Buy it all. Losers will axe you to pay for their student loan debt on this yet. It be pissed that Oprah Soros Bezos and buffet don’t give their money away. And they don’t do shit with their money like you do. Like tunneling under la neuralink and Tesla and space travel. So woke!"
    },
    {
        "id": "1519519148224794625",
        "lang": "en",
        "text": "@WillieDPOYszn Blocks are fire??? Perhaps be concerned that our district is $28 Million in debt"
    },
    {
        "id": "1519519145699782656",
        "lang": "en",
        "text": "Fox 32 - 4/27/2022 - Lawmakers speak at Student Loan Debt demonstration \n\n@BernieSanders @IlhanMN @RashidaTlaib https://t.co/t8RiOk5J9K"
    },
    {
        "id": "1519519145129242624",
        "lang": "en",
        "text": "@CassandraRules Me too, we helped our daughters with college so they have no debt. Can we get reimbursed?"
    },
    {
        "id": "1519519139211235328",
        "lang": "en",
        "text": "@PattyMurray Why? We didn't take on the debt. It's not our responsibility it's theirs."
    },
    {
        "id": "1519519138800181250",
        "lang": "en",
        "text": "@Debt_For_Pets My weakness 😵‍💫🥺🧎🏻‍♂️"
    },
    {
        "id": "1519519131443376128",
        "lang": "en",
        "text": "@leapfrogldrn @chrismohney Sure. Go to a school you can afford. Make the Best of what education wherever you can get it. I have too many friends in debt from paying out of state tuition, just to move away from Mom and Dad. TOO many friends who kept borrowing and Not using their loan money wisely!"
    },
    {
        "id": "1519519130595987456",
        "lang": "en",
        "text": "@IvermectinSheep @CraigKellyMP Craig Kelly is our only hope to remove this evil dictatorship government that has sabotaged the Australian economy&amp;the debt by the sole actions of both liberals&amp;labour show them the door then push them out over the cliff.They stuffed up the country sold ports to China,WTH wake up"
    },
    {
        "id": "1519519128977035264",
        "lang": "en",
        "text": "@DWPippy YES!!!!! \nMy son and I worked extra jobs to pay his tuition. He graduated with honors debt free. It was hard. If someone else can have an easier time or be debt free I’m all for it!"
    },
    {
        "id": "1519519126338768896",
        "lang": "en",
        "text": "@TomiLahren This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519114003365888",
        "lang": "en",
        "text": "@HoJack214 If debt forgiven… would students buy homes? Cars? Or quit working as so many did during pandemic?"
    },
    {
        "id": "1519519110123687936",
        "lang": "en",
        "text": "@PattyMurray So I go to college, pay off my student debt, work hard, pay my taxes &amp; retire.  Then I’m expected to pay for a young adults college education? Forget it!"
    },
    {
        "id": "1519519109259665408",
        "lang": "en",
        "text": "@Ilhan It’s always those that aren’t gonna pay that think it’s a good idea for somebody else too.\n\nIts Stealing if taxpayers have to pay the debt, they’re paying enough.\n\nTake it from banks and hedge funds.\n\nAsk the companies selling billions in weapons to Ukraine to paid student debt."
    },
    {
        "id": "1519519087948402689",
        "lang": "en",
        "text": "You backed a man who reneged on a campaign pledge to cancel student debt (every last cent). https://t.co/4w7IBEoMfp"
    },
    {
        "id": "1519519086614511616",
        "lang": "en",
        "text": "@TomCottonAR This policy issue should be decided by the legislative branch—Congress—not executive order. If Biden forgives student debt unilaterally it’s a usurpation of power and subversion of democracy!! It would be the move of a dictator"
    },
    {
        "id": "1519519085905821697",
        "lang": "en",
        "text": "@johnghendersons @NairbOtto @greggnunziata Lmao man's \"not paying taxes\" so what's that make this otto kid look like. Debt?😭"
    },
    {
        "id": "1519519082260975616",
        "lang": "en",
        "text": "@AaronParnas Who told you that b.s.  Those who vote dem, will still vote dem.  those who do not, will still not.  Biden paying off student loan debt (that will surely be challenged in the courts) won't move the needle."
    },
    {
        "id": "1519519077131120641",
        "lang": "en",
        "text": "@phillyrich1 @weaselzippers Raise taxes and pay off debt.  But more money in DC means more spending."
    },
    {
        "id": "1519519072882507778",
        "lang": "en",
        "text": "@iamgabesanchez Not sure he can just walk away for $1B if the debt shows up. Twitter can demand specific performance, and Musk has to know that. \n\nI don't think he wants out, he just hates Twitter management"
    },
    {
        "id": "1519519067387822080",
        "lang": "en",
        "text": "@PattyMurray Why do people think they are entitled to student loan debt forgiveness. You signed to contract. Put on your big boy/girl pants and quit relying on the government to bail you out."
    },
    {
        "id": "1519519066989285376",
        "lang": "en",
        "text": "@PattyMurray Absolutely agree that student debt should be forgiven... retroactively and only for those who have proven they have jobs, paid taxes and contributed. \n(Actually don't think any should be forgiven, but just wanted to put out another angle)"
    },
    {
        "id": "1519519066662359040",
        "lang": "en",
        "text": "@LiL_Blass Cus if you got it and just giving money away to these companies.. give to my student debt 😂"
    },
    {
        "id": "1519519066624454656",
        "lang": "en",
        "text": "Ontario had/has the largest debt in north america - wth was he supposed to do?  I gather fiscal responsibilty is something you haven't heard of.  Are your municipalities competent?  Are they fiscal responsible?  Serious question, because I don't. https://t.co/v8sEhzyQTS"
    },
    {
        "id": "1519519064045072385",
        "lang": "en",
        "text": "Forgive student debt and the left has nothing feasible left to offer wrt correcting the system"
    },
    {
        "id": "1519519063231569920",
        "lang": "en",
        "text": "@kodkod87 @DeptofDefense @USMC @usairforce @March_ARB This country repays the debt on global-standard interest rates, which can be 1 per cent of the principal amount, over 25-30 years. Japan allows an even longer repayment timeframe. But in the case of China, the average is only 15 years."
    },
    {
        "id": "1519519062207905792",
        "lang": "en",
        "text": "@JDVance1 People who have student loan debt are not rich, dbag."
    },
    {
        "id": "1519519061960441856",
        "lang": "en",
        "text": "@MittRomney You’re showing your privilege here.  Look in to each of these kinds of debts. Some are predatory, some are not.  The college debt syndicate has to be changed and I suspect you know that."
    },
    {
        "id": "1519519059523641345",
        "lang": "en",
        "text": "@PattyMurray Democrats are losing minority voters (Blacks, Hispanics, Asians), so I guess they need to pander to gender studies majors who have $200k in student debt and are living off of a $12/hour barista job (which is the only job they can find after graduation)."
    },
    {
        "id": "1519519056382017537",
        "lang": "en",
        "text": "@POkopinski @AvengerResister So the kid that learns a needed blue collar trade doesn't get their debt paid off while the priveleged kid who's daddy bought them a $75k Beamer gets a free ride for a college degree in arts history. 👍"
    },
    {
        "id": "1519519055073452033",
        "lang": "en",
        "text": "@RustinSpencer12 @elonmusk Someone needs to realize that third world debt is a cancer."
    },
    {
        "id": "1519519054544867328",
        "lang": "en",
        "text": "@elizadler13 @TomCottonAR It's no different than paying for a house, for a car, for credit card payments. Whatever you do its your choice to incur that debt. No one's going to make your house payments or car payments or credit card payments. Make better choices."
    },
    {
        "id": "1519519051499945990",
        "lang": "en",
        "text": "@xXAutumnIvyXx \"Accidently\" they says. And I don't have massive debt hahaha*sniffles*"
    },
    {
        "id": "1519519050287783936",
        "lang": "en",
        "text": "@starlightclue it’s ok at least you won’t have debt plus you’re getting the same degree sooo"
    },
    {
        "id": "1519519048194826241",
        "lang": "en",
        "text": "@Wolfiesmom Fuck you Val! My wife and I worked our asses off so our 3 daughters could graduate college without any debt! Just fuck you!"
    },
    {
        "id": "1519519046915575808",
        "lang": "en",
        "text": "If you believe in really stimulating the economy removing student loan debt would be 10x better than any tax reform would. Also would probably prevent a major recession that's on the way. https://t.co/YbY2VSRp7Q"
    },
    {
        "id": "1519519045749456900",
        "lang": "en",
        "text": "@DeAngelisCorey Biden your freaking time is coming when god us gonna collect on the debt you owe him."
    },
    {
        "id": "1519519040427167744",
        "lang": "en",
        "text": "@JonesHowdareyou @abcnews so many promises made.. never fulfilled anyway... luckily for us in some cases...\n\n#LibsAlwaysTaxMore and we get nothing for it except debt and waste"
    },
    {
        "id": "1519519036513693696",
        "lang": "en",
        "text": "@choosesam @RepAdams Guess who ends up paying these “forgiven” loans?The debt ends up on the backs of people that didn’t go to college or paid their student loans!You say your for the poor and working class.Those truck drivers,construction workers,bus drivers,waitresses,retail workers are"
    },
    {
        "id": "1519519031102955521",
        "lang": "en",
        "text": "@TomiLahren Why not offer lower interest rates?? You shouldn't cancel the debt, but make the interest 1-2%. Just my opinion."
    },
    {
        "id": "1519519031006531584",
        "lang": "en",
        "text": "@SumbzTX @PattyMurray Normal Americans didn't take out 200k in debt. Why ask the tax payer to fund the lavish lifestyle of a college student."
    },
    {
        "id": "1519519030410850305",
        "lang": "en",
        "text": "@ChrChristensen @KassyDillon I think they should create a list of people in favor  and apply the tax to pay off student debt to them. And watch them scream."
    },
    {
        "id": "1519519029421031424",
        "lang": "en",
        "text": "@harrisonjaime I worried about all the things you list. In 1995, I had $110k in loans. I paid it because I had agreed to do so. Cancelling student debt sends the wrong message to colleges, lenders &amp; students. It fails to address the root of the problem &amp; will alienate many long-time Democrats."
    },
    {
        "id": "1519519025314758656",
        "lang": "en",
        "text": "@TomiLahren Very illogical how people want to compare bank bail outs to student debt relief. Bank mgmt had negative consequences for their financial negligence. Student loan relief will entice greed among that same type of person, only this time it’ll be academic mgrs. Besides, .."
    },
    {
        "id": "1519519023284768768",
        "lang": "en",
        "text": "CANCEL STUDENT DEBT NOW!!!!! \nLet’s start a movement! #CancelStudentDebt"
    }
]